{
  "cement": "Cement is a fine binding material used to hold sand and aggregates together in concrete and mortar.",
  "sand": "Sand is a fine aggregate used in concrete, plaster, and mortar for filling voids and improving workability.",
  "aggregate": "Aggregates are coarse and fine materials like gravel, crushed stone, and sand that provide bulk to concrete.",
  "concrete": "Concrete is a mixture of cement, sand, aggregates, and water that hardens into a strong construction material.",
  "reinforcement": "Reinforcement usually refers to steel bars (rebar) used in concrete to resist tensile forces.",
  "beam": "A horizontal structural element that resists bending and transfers loads to columns or walls.",
  "column": "A vertical structural member that carries loads from beams or slabs down to the foundation.",
  "slab": "A flat horizontal structural element made of concrete, used for floors and roofs.",
  "foundation": "The lowest structural element of a building that transfers loads safely to the ground.",
  "mortar": "Mortar is a paste of cement, sand, and water used to bond bricks or stones together.",
  "brick": "A brick is a rectangular block made of clay or concrete used in masonry construction.",
  "steel": "Steel is a strong metal alloy used in construction for reinforcement and structural members.",
  "plaster": "Plaster is a mixture applied on walls and ceilings for smooth finishing and protection.",
  "curing": "Curing is the process of maintaining moisture in concrete to ensure proper hydration and strength gain.",
  "formwork": "Temporary molds used to hold fresh concrete in shape until it hardens.",
  "shuttering": "Shuttering is another term for formwork, usually made of wood, steel, or plastic.",
  "scaffolding": "Temporary structures used by workers to reach higher levels during construction or repair.",
  "bitumen": "Bitumen is a black, sticky substance derived from petroleum used in road construction and waterproofing.",
  "asphalt": "Asphalt is a mixture of aggregates and bitumen used in road surfacing and paving.",
  "mix design": "The process of selecting suitable proportions of cement, sand, aggregates, and water to achieve desired concrete strength.",
  "footing": "Footing is the part of the foundation that directly contacts the soil and spreads the load of the structure.",
  "lintel": "A lintel is a horizontal structural element placed over openings like doors and windows.",
  "truss": "A truss is a framework of members forming triangular units to support roofs and bridges.",
  "girder": "A girder is a large beam that supports other beams or loads in a structure.",
  "pile foundation": "A deep foundation element driven into the ground to transfer loads to deeper soil layers.",
  "retaining wall": "A structure built to hold or retain soil behind it.",
  "fly ash": "Fly ash is a by-product of coal combustion used as a supplementary cementitious material in concrete.",
  "GGBS": "Ground Granulated Blast Furnace Slag is a by-product of the steel industry used as a partial replacement for cement.",
  "admixtures": "Admixtures are materials added to concrete to modify its properties, such as setting time or workability.",
  "waterproofing": "A method used to prevent water from entering a structure.",
  "bulldozer": "A heavy machine used to push large quantities of soil, sand, or debris during construction work.",
  "crane": "A lifting machine used to move heavy loads in construction sites.",
  "concrete mixer": "A machine that mixes cement, sand, aggregates, and water to form concrete.",
  "vibrator": "A tool used in concrete works to remove air bubbles and ensure compaction.",
  "welding": "A process of joining metals by heating them to a high temperature.",
  "surveying": "The process of measuring land and preparing site layouts for construction.",
  "IS 456": "Indian Standard code of practice for plain and reinforced concrete.",
  "IS 383": "Indian Standard code for specification of coarse and fine aggregates for concrete.",
  "ACI code": "American Concrete Institute guidelines for concrete design and construction.",
  "slump test": "A test to measure the workability and consistency of fresh concrete.",
  "compaction": "The process of pressing soil or concrete to reduce air voids and increase strength.",
  "hardness": "A property of construction materials that indicates resistance to indentation or abrasion.",
  "tensile strength": "The resistance of a material to breaking under tension.",
  "compressive strength": "The capacity of a material to resist loads that reduce its size.",
  "bending moment": "A measure of the bending effect due to forces acting on a beam.",
  "shear force": "An internal force acting along a plane, resisting sliding of one part over another.",
  "load bearing wall": "A wall that carries structural loads from above floors or roof.",
  "non load bearing wall": "A wall that only divides spaces and carries no structural load.",
  "precast concrete": "Concrete elements cast in a factory and transported to the construction site.",
  "ready mix concrete": "Concrete that is manufactured in a batching plant and delivered to site in mixer trucks.",
  "hollow blocks": "Lightweight blocks with hollow cavities used in wall construction.",
  "paver blocks": "Precast concrete blocks used for pavements, driveways, and walkways.",
  "tiles": "Thin flat coverings used on floors and walls for durability and aesthetics.",
  "marble": "A metamorphic rock used for flooring, cladding, and decorative purposes.",
  "granite": "A strong igneous rock commonly used for kitchen platforms, flooring, and facades.",
  "gypsum": "A soft mineral used for making plaster of Paris and false ceilings.",
  "POP": "Plaster of Paris, a quick-setting material used for finishing and decorative works.",
  "false ceiling": "A secondary ceiling hung below the main ceiling for aesthetics or insulation.",
  "drywall": "Prefabricated wall panels made of gypsum board fixed with screws on frames.",
  "hardwood": "Dense wood from broad-leaved trees used in flooring and furniture.",
  "softwood": "Wood from coniferous trees, lighter and commonly used in shuttering and furniture.",
  "paint": "A coating applied to surfaces for protection, durability, and aesthetics.",
  "primer": "An undercoat applied before painting to improve adhesion and durability.",
  "sealant": "A flexible material used to block passage of fluids through joints or openings.",
  "insulation": "Material used to reduce heat transfer and improve energy efficiency.",
  "HVAC": "Heating, Ventilation, and Air Conditioning systems used in buildings.",
  "green building": "A building designed for sustainability and reduced environmental impact.",
  "LEED": "Leadership in Energy and Environmental Design, a global green building certification system.",
  "BIM": "Building Information Modeling, a digital representation of physical and functional characteristics of a facility.",
  "CAD": "Computer-Aided Design software used for creating precise construction drawings.",
  "draughting": "The process of preparing technical drawings for construction.",
  "estimation": "The process of calculating quantities and costs required for construction.",
  "BOQ": "Bill of Quantities, a document listing items, quantities, and costs for a project.",
  "tender": "A formal offer submitted by a contractor to carry out construction work.",
  "contract": "A legal agreement between client and contractor defining responsibilities and payments.",
  "project management": "The process of planning, executing, and controlling construction projects.",
  "CPM": "Critical Path Method, a project management technique to schedule activities.",
  "PERT": "Program Evaluation and Review Technique, used for project scheduling under uncertainty.",
  "Gantt chart": "A bar chart representing project schedule and progress.",
  "quality control": "Processes to ensure construction meets required standards.",
  "safety helmet": "A protective headgear worn at construction sites.",
  "PPE": "Personal Protective Equipment, including helmet, gloves, goggles, and safety boots.",
  "OSHA": "Occupational Safety and Health Administration standards for workplace safety.",
  "bar bending schedule": "A tabular representation of reinforcement bars used in construction.",
  "brick bond": "Arrangement of bricks in a wall for strength and aesthetics.",
  "English bond": "A type of brick bond alternating headers and stretchers in each course.",
  "Flemish bond": "A brick bond with alternate headers and stretchers in each course.",
  "arch": "A curved structure that spans an opening and transfers loads.",
  "dome": "A rounded vault forming the roof of a structure.",
  "bridge": "A structure built to span physical obstacles like rivers or roads.",
  "dam": "A barrier built across a river to store water or generate electricity.",
  "canal": "A man-made waterway used for irrigation or navigation.",
  "highway": "A main road designed for fast traffic between cities.",
  "runway": "A strip of land at an airport used for aircraft takeoff and landing.",
  "railway": "A track with trains for transportation of people and goods.",
  "airport terminal": "A building at an airport where passengers check in, board, and disembark.",
  "stadium": "A large open-air structure for sports events and gatherings.",
  "skyscraper": "A very tall multi-storey building.",
  "tower crane": "A tall crane used in high-rise construction for lifting heavy materials.",
  "prefabrication": "The practice of assembling building components in a factory before transporting to site.",
  "modular construction": "Construction method using prefabricated modules for fast assembly."

}
